In [1]:
# Pandas Series

In [2]:
import pandas as pd

In [3]:
pd.Series([10,21,34,47,51])

0    10
1    21
2    34
3    47
4    51
dtype: int64

In [4]:
sr=pd.Series([10,21,34,47,51])

In [5]:
type(sr)

pandas.core.series.Series

In [6]:
sr.axes

[RangeIndex(start=0, stop=5, step=1)]

In [7]:
sr.dtype

dtype('int64')

In [8]:
sr.size

5

In [9]:
sr.ndim

1

In [10]:
sr.values

array([10, 21, 34, 47, 51], dtype=int64)

In [11]:
sr.head(3)

0    10
1    21
2    34
dtype: int64

In [12]:
sr.tail(3)

2    34
3    47
4    51
dtype: int64

In [13]:
# Index naming

In [14]:
pd.Series([199,22,334,92,4])

0    199
1     22
2    334
3     92
4      4
dtype: int64

In [15]:
pd.Series([199,22,334,92,4],index=[1,3,5,7,9])

1    199
3     22
5    334
7     92
9      4
dtype: int64

In [16]:
sr1=pd.Series([199,22,334,92,4],index=["a","b","c","d","e"])

In [17]:
sr1

a    199
b     22
c    334
d     92
e      4
dtype: int64

In [18]:
sr1["a"]

199

In [19]:
sr1["b"]

22

In [20]:
# make a serie by using dictionary object

In [21]:
dict1={"reg":10,"log":11,"cart":12}

In [22]:
sr2=pd.Series(dict1)
sr2

reg     10
log     11
cart    12
dtype: int64

In [23]:
#concatenate the series

In [24]:
pd.concat([sr1,sr2])

a       199
b        22
c       334
d        92
e         4
reg      10
log      11
cart     12
dtype: int64

In [25]:
# Operations on the series

In [26]:
import numpy as np

In [27]:
a=np.array([1,5,14,345,123,75])
sr3=pd.Series(a)
sr3

0      1
1      5
2     14
3    345
4    123
5     75
dtype: int32

In [28]:
sr3[0:3]

0     1
1     5
2    14
dtype: int32

In [29]:
sr4=pd.Series([123,328,43,56,],index=["reg","loj","cart","rf"])
sr4

reg     123
loj     328
cart     43
rf       56
dtype: int64

In [30]:
sr4.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [31]:
sr4.values

array([123, 328,  43,  56], dtype=int64)

In [32]:
sr4.keys

<bound method Series.keys of reg     123
loj     328
cart     43
rf       56
dtype: int64>

In [33]:
list(sr4.items())

[('reg', 123), ('loj', 328), ('cart', 43), ('rf', 56)]

In [34]:
"reg" in sr4

True

In [35]:
234 in sr4

False

In [36]:
sr4["reg"]

123

In [37]:
sr4["loj"]

328

In [38]:
# Slice the series by using fancy method

In [39]:
sr4[["reg","rf"]] #

reg    123
rf      56
dtype: int64

In [40]:
sr4["reg":"rf"]

reg     123
loj     328
cart     43
rf       56
dtype: int64

In [41]:
# PANDAS DATAFRAME

In [42]:
# The ways of creating of dataframe

In [43]:
import pandas as pd

In [44]:
v=[1,2,34,67,98]

In [45]:
pd.DataFrame(v,columns=["var1"])

   var1
0     1
1     2
2    34
3    67
4    98

In [46]:
import numpy as np
m=np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [47]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [48]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [49]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [50]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [51]:
df.columns=("x","y","z")

In [52]:
df

   x  y  z
0  1  2  3
1  4  5  6
2  7  8  9

In [53]:
type(df)

pandas.core.frame.DataFrame

In [54]:
df.axes

[RangeIndex(start=0, stop=3, step=1), Index(['x', 'y', 'z'], dtype='object')]

In [55]:
df.shape

(3, 3)

In [56]:
df.ndim

2

In [57]:
df.size

9

In [58]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [59]:
type(df.values)

numpy.ndarray

In [60]:
df.head(2)

   x  y  z
0  1  2  3
1  4  5  6

In [61]:
df.tail(1)

   x  y  z
2  7  8  9

In [62]:
# Operation on dataframes

In [63]:
import numpy as np
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [64]:
dict2={"var1":s1,"var2":s2,"var3":s3}

In [65]:
dict2

{'var1': array([6, 0, 4, 8, 6]),
 'var2': array([7, 1, 3, 4, 3]),
 'var3': array([9, 7, 5, 5, 1])}

In [66]:
df2=pd.DataFrame(dict2)

In [67]:
df2

   var1  var2  var3
0     6     7     9
1     0     1     7
2     4     3     5
3     8     4     5
4     6     3     1

In [68]:
df2[0:1]

   var1  var2  var3
0     6     7     9

In [69]:
df2[0:3]

   var1  var2  var3
0     6     7     9
1     0     1     7
2     4     3     5

In [70]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [71]:
df2.index=("a","b","c","d","e")

In [72]:
df2

   var1  var2  var3
a     6     7     9
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [73]:
df2["c":"e"]

   var1  var2  var3
c     4     3     5
d     8     4     5
e     6     3     1

In [74]:
df2.drop("a",axis=0)

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [75]:
df2

   var1  var2  var3
a     6     7     9
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [76]:
df2.drop("a",axis=0,inplace=True)

In [77]:
df2

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [78]:
# drop the index or columns by using fancy method

In [79]:
l=["c","e"]
df2.drop(l,axis=0)

   var1  var2  var3
b     0     1     7
d     8     4     5

In [80]:
df2

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [81]:
df2.drop(["b","e"],axis=0)

   var1  var2  var3
c     4     3     5
d     8     4     5

In [82]:
df2

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [83]:
df2.drop(["var1","var2"],axis=1)

   var3
b     7
c     5
d     5
e     1

In [84]:
df2

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [85]:
# Operation on columns

In [86]:
"var1" in df2

True

In [87]:
"b" in df2

False

In [88]:
3 in df2

False

In [89]:
"var3" in df2

True

In [90]:
clm=["var1","var4","var2"]
for i in clm:
    print(i in df2)

True
False
True

In [91]:
df2

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [92]:
df2["b":"d"]

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5

In [93]:
df2["var1"]

b    0
c    4
d    8
e    6
Name: var1, dtype: int32

In [94]:
df2[["var1","var3"]]

   var1  var3
b     0     7
c     4     5
d     8     5
e     6     1

In [95]:
df2["var4"]=df2["var1"]/df2["var2"]

In [96]:
df2

   var1  var2  var3      var4
b     0     1     7  0.000000
c     4     3     5  1.333333
d     8     4     5  2.000000
e     6     3     1  2.000000

In [97]:
df2.drop("var4",axis=1)

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [98]:
df2

   var1  var2  var3      var4
b     0     1     7  0.000000
c     4     3     5  1.333333
d     8     4     5  2.000000
e     6     3     1  2.000000

In [99]:
df2.drop("var4", axis=1, inplace=True)
df2

   var1  var2  var3
b     0     1     7
c     4     3     5
d     8     4     5
e     6     3     1

In [100]:
l=["var1","var2"]
df2.drop(l, axis=1 )

   var3
b     7
c     5
d     5
e     1

In [101]:
# select features of dataframa by using loc & iloc

In [102]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30, size=(10,3))
df3=pd.DataFrame(m,columns=["var1","var2","var3"])

In [103]:
df3

   var1  var2  var3
0    22    19    17
1     1    17     4
2    25    21    23
3     7     1     1
4    11    16     3
5    22    16    28
6    11    23    10
7     4     8     5
8    15    23    10
9    13    16    16

In [104]:
df3.loc[0:3]

   var1  var2  var3
0    22    19    17
1     1    17     4
2    25    21    23
3     7     1     1

In [105]:
df3.iloc[0:3]

   var1  var2  var3
0    22    19    17
1     1    17     4
2    25    21    23

In [106]:
df3.loc[2:9]

   var1  var2  var3
2    25    21    23
3     7     1     1
4    11    16     3
5    22    16    28
6    11    23    10
7     4     8     5
8    15    23    10
9    13    16    16

In [107]:
df3.iloc[2:9]

   var1  var2  var3
2    25    21    23
3     7     1     1
4    11    16     3
5    22    16    28
6    11    23    10
7     4     8     5
8    15    23    10

In [108]:
df3

   var1  var2  var3
0    22    19    17
1     1    17     4
2    25    21    23
3     7     1     1
4    11    16     3
5    22    16    28
6    11    23    10
7     4     8     5
8    15    23    10
9    13    16    16

In [109]:
df3.iloc[0,0]

22

In [110]:
df3.iloc[5,2]

28

In [111]:
df3.iloc[:3,:2]

   var1  var2
0    22    19
1     1    17
2    25    21

In [112]:
df3.loc[0:3,"var1"]

0    22
1     1
2    25
3     7
Name: var1, dtype: int32

In [113]:
df3.loc[0:3,["var1","var3"]]

   var1  var3
0    22    17
1     1     4
2    25    23
3     7     1

In [114]:
df3.iloc[0:3]["var1"]

0    22
1     1
2    25
Name: var1, dtype: int32

In [115]:
df3.iloc[0:3][["var1","var3"]]

   var1  var3
0    22    17
1     1     4
2    25    23

In [116]:
#Conditional operations

In [117]:
df3

   var1  var2  var3
0    22    19    17
1     1    17     4
2    25    21    23
3     7     1     1
4    11    16     3
5    22    16    28
6    11    23    10
7     4     8     5
8    15    23    10
9    13    16    16

In [118]:
df3["var1"]

0    22
1     1
2    25
3     7
4    11
5    22
6    11
7     4
8    15
9    13
Name: var1, dtype: int32

In [119]:
df3.var1

0    22
1     1
2    25
3     7
4    11
5    22
6    11
7     4
8    15
9    13
Name: var1, dtype: int32

In [120]:
df3[["var1","var3"]]

   var1  var3
0    22    17
1     1     4
2    25    23
3     7     1
4    11     3
5    22    28
6    11    10
7     4     5
8    15    10
9    13    16

In [121]:
df3[["var1","var3"]][0:3]

   var1  var3
0    22    17
1     1     4
2    25    23

In [122]:
df3[0:3][["var1","var3"]]

   var1  var3
0    22    17
1     1     4
2    25    23

In [123]:
df3

   var1  var2  var3
0    22    19    17
1     1    17     4
2    25    21    23
3     7     1     1
4    11    16     3
5    22    16    28
6    11    23    10
7     4     8     5
8    15    23    10
9    13    16    16

In [124]:
df3["var1"]>15

0     True
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: var1, dtype: bool

In [125]:
df3[df3["var1"]>15]

   var1  var2  var3
0    22    19    17
2    25    21    23
5    22    16    28

In [126]:
df3[df3["var1"]>15][["var1","var3"]]

   var1  var3
0    22    17
2    25    23
5    22    28

In [127]:
df3[(df3["var1"]>15) & (df3["var3"]>8)]

   var1  var2  var3
0    22    19    17
2    25    21    23
5    22    16    28

In [128]:
# JOIN  operation

In [129]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30, size=(5,3))
df4=pd.DataFrame(m,columns=["var1","var2","var3"])
df4

   var1  var2  var3
0     8    13     2
1    24    19    11
2    21    25    21
3     7    19    27
4    19     6     1

In [130]:
df5=df4+99
df5

   var1  var2  var3
0   107   112   101
1   123   118   110
2   120   124   120
3   106   118   126
4   118   105   100

In [131]:
pd.concat([df4,df5])

   var1  var2  var3
0     8    13     2
1    24    19    11
2    21    25    21
3     7    19    27
4    19     6     1
0   107   112   101
1   123   118   110
2   120   124   120
3   106   118   126
4   118   105   100

In [132]:
pd.concat([df4,df5],axis=0)# the number of row increase

   var1  var2  var3
0     8    13     2
1    24    19    11
2    21    25    21
3     7    19    27
4    19     6     1
0   107   112   101
1   123   118   110
2   120   124   120
3   106   118   126
4   118   105   100

In [133]:
pd.concat([df4,df5],axis=0,ignore_index=True)

   var1  var2  var3
0     8    13     2
1    24    19    11
2    21    25    21
3     7    19    27
4    19     6     1
5   107   112   101
6   123   118   110
7   120   124   120
8   106   118   126
9   118   105   100

In [134]:
pd.concat([df4,df5],axis=1)#number of columns increase

   var1  var2  var3  var1  var2  var3
0     8    13     2   107   112   101
1    24    19    11   123   118   110
2    21    25    21   120   124   120
3     7    19    27   106   118   126
4    19     6     1   118   105   100

In [135]:
df4

   var1  var2  var3
0     8    13     2
1    24    19    11
2    21    25    21
3     7    19    27
4    19     6     1

In [136]:
df4.columns=["var1","var2","XYXY"]
df4

   var1  var2  XYXY
0     8    13     2
1    24    19    11
2    21    25    21
3     7    19    27
4    19     6     1

In [137]:
df4

   var1  var2  XYXY
0     8    13     2
1    24    19    11
2    21    25    21
3     7    19    27
4    19     6     1

In [138]:
df5

   var1  var2  var3
0   107   112   101
1   123   118   110
2   120   124   120
3   106   118   126
4   118   105   100

In [139]:
pd.concat([df4,df5])

   var1  var2  XYXY   var3
0     8    13   2.0    NaN
1    24    19  11.0    NaN
2    21    25  21.0    NaN
3     7    19  27.0    NaN
4    19     6   1.0    NaN
0   107   112   NaN  101.0
1   123   118   NaN  110.0
2   120   124   NaN  120.0
3   106   118   NaN  126.0
4   118   105   NaN  100.0

In [140]:
pd.concat([df4,df5],join="inner",)

   var1  var2
0     8    13
1    24    19
2    21    25
3     7    19
4    19     6
0   107   112
1   123   118
2   120   124
3   106   118
4   118   105

In [141]:
#  JOIN/MERGE operations

In [142]:
df6=pd.DataFrame({'Employee name':['john','mark','hans','jack'],'Department':['Account','Engeneer','Engeneer','HR']})
df6

  Employee name Department
0          john    Account
1          mark   Engeneer
2          hans   Engeneer
3          jack         HR

In [143]:
df7=pd.DataFrame({'Employee name':['john','mark','hans','jack'],'Start year of work':['2010','2005','2008','2015']})
df7

  Employee name Start year of work
0          john               2010
1          mark               2005
2          hans               2008
3          jack               2015

In [144]:
pd. merge(df6,df7)

  Employee name Department Start year of work
0          john    Account               2010
1          mark   Engeneer               2005
2          hans   Engeneer               2008
3          jack         HR               2015

In [145]:
pd.merge(df6,df7,on="Employee name")

  Employee name Department Start year of work
0          john    Account               2010
1          mark   Engeneer               2005
2          hans   Engeneer               2008
3          jack         HR               2015

In [146]:
df8=pd.merge(df6,df7)
df8

  Employee name Department Start year of work
0          john    Account               2010
1          mark   Engeneer               2005
2          hans   Engeneer               2008
3          jack         HR               2015

In [147]:
df9=pd.DataFrame({"Department":['Account','Engeneer','HR'],'Manager of Deparmant':['Lincon','justin','james']})
df9

  Department Manager of Deparmant
0    Account               Lincon
1   Engeneer               justin
2         HR                james

In [148]:
pd.merge(df8,df9)

  Employee name Department Start year of work Manager of Deparmant
0          john    Account               2010               Lincon
1          mark   Engeneer               2005               justin
2          hans   Engeneer               2008               justin
3          jack         HR               2015                james

In [149]:
# Aggregation  Operations

In [150]:
import seaborn as sns
df10=sns.load_dataset("planets")
df10.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [151]:
df10.shape

(1035, 6)

In [152]:
df10.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [153]:
df10.mass.mean()

2.6381605847953233

In [154]:
df10["mass"].mean()

2.6381605847953233

In [155]:
df10["mass"].count()

513

In [156]:
df10["mass"].max()

25.0

In [157]:
df10["mass"].min()

0.0036

In [158]:
df10["mass"].sum()

1353.37638

In [159]:
df10["mass"].std()

3.8186166509616046

In [160]:
df10["mass"].var()

14.58183312700122

In [161]:
df10.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [162]:
df10.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [163]:
df10.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [164]:
# Aggregation & Grouping Operations

In [165]:
df11=pd.DataFrame({'Groups':['A','B','C','A','B','C'],'Data':[10,11,52,23,43,55]},
                    columns=['Groups','Data'])
df11

  Groups  Data
0      A    10
1      B    11
2      C    52
3      A    23
4      B    43
5      C    55

In [166]:
df11.groupby("Groups")

In [167]:
df11.groupby("Groups").mean()

        Data
Groups
A       16.5
B       27.0
C       53.5

In [168]:
df11.groupby("Groups").sum()

        Data
Groups
A         33
B         54
C        107

In [169]:
df10.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [170]:
df10.groupby("method")

In [171]:
df10.groupby("method")["orbital_period"]

In [172]:
df10.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [173]:
df10.groupby("method")["year"].count()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: year, dtype: int64

In [174]:
df10.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [175]:
df10.groupby("method")["orbital_period"].describe().T

method,Astrometry,Eclipse Timing Variations,Imaging,Microlensing,Orbital Brightness Modulation,Pulsar Timing,Pulsation Timing Variations,Radial Velocity,Transit,Transit Timing Variations
count,2.000000,9.000000,12.000000,7.000000,3.000000,5.000000,1.0,553.00000,397.000000,3.000000
mean,631.180000,4751.644444,118247.737500,3153.571429,0.709307,7343.021201,1170.0,823.35468,21.102073,79.783500
std,544.217663,2499.130945,213978.177277,1113.166333,0.725493,16313.265573,NaN,1454.92621,46.185893,71.599884
min,246.360000,1916.250000,4639.150000,1825.000000,0.240104,0.090706,1170.0,0.73654,0.355000,22.339500
25%,438.770000,2900.000000,8343.900000,2375.000000,0.291496,25.262000,1170.0,38.02100,3.160630,39.675250
50%,631.180000,4343.500000,27500.000000,3300.000000,0.342887,66.541900,1170.0,360.20000,5.714932,57.011000
75%,823.590000,5767.000000,94250.000000,3550.000000,0.943908,98.211400,1170.0,982.00000,16.145700,108.505500
max,1016.000000,10220.000000,730000.000000,5100.000000,1.544929,36525.000000,1170.0,17337.50000,331.600590,160.000000

In [176]:
# Aggregate, filter, transform,apply FUNCTION

In [180]:
import pandas as pd
import numpy as np
df11=pd.DataFrame({"groups":['A','B','C','A','B','C'],
                  'var1':[10,23,33,22,11,99],
                  'var2':[100,253,333,262,111,969]},
                 columns=['groups','var1','var2'])
df11

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [181]:
df11.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [182]:
df11.groupby("groups")["var1"].mean()

groups
A    16
B    17
C    66
Name: var1, dtype: int64

In [ ]:
#Aggregate

In [184]:
df11.groupby("groups").aggregate([min,max,np.median])

       var1            var2
        min max median  min  max median
groups
A        10  22     16  100  262    181
B        11  23     17  111  253    182
C        33  99     66  333  969    651

In [185]:
df11.groupby("groups").aggregate({"var1":"min","var2":np.median})

        var1  var2
groups
A         10   181
B         11   182
C         33   651

In [ ]:
#filter

In [186]:
df11

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [187]:
def filter_fun(x):
    return x["var1"].std()>9

In [188]:
df11.groupby("groups").std()

             var1        var2
groups
A        8.485281  114.551299
B        8.485281  100.409163
C       46.669048  449.719913

In [189]:
df11.groupby("groups").filter(filter_fun)

  groups  var1  var2
2      C    33   333
5      C    99   969

In [190]:
#transform

In [191]:
df11

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [193]:
df11["var1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: var1, dtype: int64

In [194]:
df11_a=df11.iloc[:,1:]
df11_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [196]:
df11_a.transform(lambda x: (x-x.mean())/x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [197]:
df11

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [198]:
#apply

In [202]:
df12=df11_a
df12

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [203]:
df12.apply(sum)

var1     198
var2    2028
dtype: int64

In [207]:
df12.apply(np.mean)

var1     33.0
var2    338.0
dtype: float64

In [210]:
df11

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [209]:
df11.groupby("groups").apply(np.sum)

       groups  var1  var2
groups
A          AA    32   362
B          BB    34   364
C          CC   132  1302

In [211]:
# Pivot Table

In [212]:
import pandas as pd
import seaborn as sns
titanic=sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [213]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [214]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [219]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [220]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [221]:
titanic.pivot_table("fare",index="sex",columns="class")

class        First     Second      Third
sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [222]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [223]:
age=pd.cut(titanic["age"],[0,18,90] )# buradaki cut fonksiyonu  age sutununu 0 -18 ve 18-90 arasi yalari kategorik olarak boldu
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [224]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663